Repository: Akram0100/BotFactory
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uz

source: Dashboard
uz: Boshqaruv paneli

source: My Bots
uz: Mening botlarim

source: Plans
uz: Rejalar

source: Language
uz: Til

source: English
uz: Ingliz tili

source: Russian
uz: Rus tili

source: Uzbek
uz: O'zbek tili

source: Profile
uz: Profil

source: Settings
uz: Sozlamalar

source: Logout
uz: Chiqish

source: Login
uz: Kirish

source: Sign Up
uz: Ro'yxatdan o'tish

source: Features
uz: Xususiyatlar

source: AI-Powered Responses
uz: AI asosidagi javoblar

source: Knowledge Base
uz: Bilimlar bazasi

source: Analytics
uz: Analitika

source: Support
uz: Yordam

source: Documentation
uz: Hujjatlar

source: Contact Us
uz: Biz bilan bog'laning

source: FAQ
uz: Tez-tez beriladigan savollar

source: All rights reserved.
uz: Barcha huquqlar himoyalangan.

source: Powered by Google Gemini AI
uz: Google Gemini AI tomonidan quvvatlanadi

source: Create New Bot
uz: Yangi bot yaratish

source: Fill in the details below to get started
uz: Boshlash uchun quyidagi ma'lumotlarni to'ldiring

source: Bot Name
uz: Bot nomi

source: Choose a friendly name that represents your bot's purpose
uz: Bot maqsadini aks ettiradigan do'stona nom tanlang

source: Description
uz: Tavsif

source: No description provided
uz: Tavsif berilmagan

source: Deactivate
uz: O'chirish

source: Delete
uz: O'chirish

source: Total Messages
uz: Jami xabarlar

source: Users Served
uz: Xizmat ko'rsatilgan foydalanuvchilar

source: Knowledge Entries
uz: Bilimlar yozuvlari

source: Basic Settings
uz: Asosiy sozlamalar

source: Telegram Setup
uz: Telegram sozlamalari

source: Test Bot
uz: Botni sinash

source: Bot Configuration
uz: Bot konfiguratsiyasi

source: Telegram Username
uz: Telegram foydalanuvchi nomi

source: Not configured
uz: Sozlanmagan

source: Bot Personality & Instructions
uz: Bot shaxsiyati va ko'rsatmalar

source: Define how your bot should behave and respond to users.
uz: Botingiz qanday harakat qilishi va foydalanuvchilarga javob berishi kerakligini belgilang.

source: Save Changes
uz: O'zgarishlarni saqlash

source: Telegram Bot Configuration
uz: Telegram bot konfiguratsiyasi

source: Bot is connected to Telegram as
uz: Bot Telegramga quyidagicha ulangan

source: To deploy your bot to Telegram, you need to create a bot token via @BotFather.
uz: Botingizni Telegramga joylashtirish uchun @BotFather orqali bot token yaratishingiz kerak.Botingizni Telegramga joylashtirish uchun @BotFather orqali bot token yaratishingiz kerak.

source: Telegram Bot Token
uz: Telegram bot tokeni

source: Get this token by messaging @BotFather on Telegram and creating a new bot.
uz: Bu tokenni olish uchun Telegramda @BotFather ga xabar yozib, yangi bot yarating.Ushbu tokenni Telegramda @BotFather ga xabar yuborish va yangi bot yaratish orqali oling.

source: How to get a Telegram Bot Token:
uz: Telegram Bot Tokenini qanday olish mumkin:

source: My AI Chatbots
uz: Mening AI chatbotlarim

source: Manage and monitor your intelligent chatbots
uz: Aqlli chatbotlaringizni boshqaring va kuzating

source: Upgrade to Create More
uz: Ko'proq yaratish uchun yangilang

source: Bot Limit Reached
uz: Bot chegarasiga yetildi

source: You are using %(current)s of %(max)s available bots.
uz: Siz %(max)s ta mavjud botdan %(current)s tasini ishlatyapsiz.

source: Upgrade Plan
uz: Rejani yangilash

source: Users
uz: Foydalanuvchilar

source: Welcome back, %(name)s!
uz: Xush kelibsiz, %(name)s!

source: Manage your AI chatbots and monitor performance
uz: AI chatbotlaringizni boshqaring va samaradorlikni kuzating

source: Admin Panel
uz: Admin paneli

source: Total Bots
uz: Jami botlar

source: Active Bots
uz: Faol botlar

source: Your Bots
uz: Sizning botlaringiz

source: View All
uz: Barchasini ko'rish

source: No Bots Yet
uz: Hali botlar yo'q

source: Create your first AI chatbot to get started
uz: Boshlash uchun birinchi AI chatbotingizni yarating

source: Create Your First Bot
uz: Birinchi botingizni yarating

source: Your Plan
uz: Sizning rejangiz

source: Bots Used
uz: Ishlatilgan botlar

source: Active Subscription
uz: Faol obuna

source: Quick Actions
uz: Tezkor amallar

source: Manage Bots
uz: Botlarni boshqarish

source: View Plans
uz: Rejalarni ko'rish

source: Need help?
uz: Yordam kerakmi?

source: Contact Support
uz: Yordam xizmatiga murojaat qiling

source: Create Powerful AI Chatbots in Minutes
uz: Bir necha daqiqada kuchli AI chatbotlarini yarating

source: Build intelligent chatbots for Telegram and other platforms using Google Gemini AI. No coding required - just upload your knowledge base and deploy!
uz: Google Gemini AI yordamida Telegram va boshqa platformalar uchun aqlli chatbotlarni yarating. Dasturlash talab qilinmaydi - faqat bilimlar bazasini yuklang va joylashtiring!

source: Get Started Free
uz: Bepul boshlang

source: Learn More
uz: Batafsil

source: Free tier available
uz: Bepul tarif mavjud

source: No credit card required
uz: Kredit karta talab qilinmaydi

source: Why Choose BotFactory?
uz: Nega BotFactory ni tanlash kerak?

source: Everything you need to create and deploy intelligent chatbots
uz: Aqlli chatbotlar yaratish va joylashtirish uchun kerak bo'lgan hamma narsaAqlli chatbotlarni yaratish va joylashtirish uchun kerak bo'lgan hamma narsa

source: Powered by Google Gemini AI for natural, intelligent conversations that understand context and provide helpful responses.
uz: Google Gemini AI tomonidan quvvatlanadi, tabiiy va aqlli suhbatlar uchun kontekstni tushunadi va foydali javoblar beradi.

source: Deploy your bots directly to Telegram with one click. Reach millions of users where they already are.
uz: Botlaringizni bir click bilan bevosita Telegramga joylashtiring. Millionlab foydalanuvchilarga ular allaqachon turgan joyda yeting.

source: Upload your documents, FAQs, and content to train your bot with your specific knowledge and expertise.
uz: Hujjatlaringiz, tez-tez beriladigan savollar va kontentingizni yuklang va botingizni o'zingizning maxsus bilim va tajribangiz bilan o'rgating.

source: No coding required. Create and customize your chatbot with our intuitive web interface in just minutes.
uz: Dasturlash talab qilinmaydi. Bizning intuitiv web interfeysimiz bilan bir necha daqiqada chatbotingizni yarating va sozlang.

source: Analytics & Insights
uz: Analitika va Statistika

source: Track conversations, user engagement, and bot performance with detailed analytics and reporting.
uz: Suhbatlar, foydalanuvchilar faolligi va bot ishlashini batafsil analitika va hisobotlar bilan kuzating.

source: Secure & Reliable
uz: Xavfsiz va Ishonchli

source: How It Works
uz: Qanday ishlaydi

source: Simple, Transparent Pricing
uz: Oddiy va shaffof narxlar

source: Start free and scale as you grow
uz: Bepul boshlang va o'sayotganda kengaytiring

source: Free
uz: Bepul

source: /month
uz: /oyiga

source: Create Your Account
uz: Hisobingizni yarating

source: Start building AI chatbots today
uz: Bugun AI chatbotlar yaratishni boshlang

source: First Name
uz: Ism

source: Enter first name
uz: Ismingizni kiriting

source: Last Name
uz: Familiya

source: 3-30 characters, letters, numbers and underscore only
uz: 3-30 ta belgi, faqat harf, raqam va pastki chiziq

source: Enter your email
uz: Email manzilingizni kiriting

source: Password
uz: Parol

source: Create a password
uz: Parol yarating

source: Minimum 6 characters
uz: Kamida 6 ta belgi

source: Confirm Password
uz: Parolni tasdiqlang

source: Confirm your password
uz: Parolingizni tasdiqlang

source: I agree to the
uz: Men quyidagi bilan roziman:

source: and
uz: va

source: Privacy Policy
uz: Maxfiylik siyosati

source: Already have an account?
uz: Hisobingiz bormi?

source: Sign In Instead
uz: Kirish

source: Quick Setup
uz: Tez sozlash

source: Knowledge base entry added successfully!
uz: Bilim bazasi yozuvi muvaffaqiyatli qo'shildi!

source: Failed to add knowledge base entry.
uz: Bilim bazasi yozuvini qo'shib bo'lmadi.

source: No file selected.
uz: Hech qanday fayl tanlanmadi.

source: File "%(filename)s" uploaded successfully!
uz: "%(filename)s" fayli muvaffaqiyatli yuklandi!

source: File must be text-based (UTF-8 encoded).
uz: Fayl matn ko'rinishida (UTF-8 kodlangan) bo'lishi kerak.

source: File too large. Maximum size is 16MB.
uz: Fayl juda katta. Maksimal hajmi 16MB.

source: Failed to upload file.
uz: Faylni yuklab bo'lmadi.

source: Knowledge base entry updated successfully!
uz: Bilim bazasi yozuvi muvaffaqiyatli yangilandi!

source: Failed to update knowledge base entry.
uz: Bilim bazasi yozuvini yangilab bo'lmadi.

source: All fields are required.
uz: Barcha maydonlar to'ldirilishi kerak.

source: Knowledge base entry deleted successfully!
uz: Bilim bazasi yozuvi muvaffaqiyatli o'chirildi!

source: Failed to delete entry.
uz: Yozuvni o'chirib bo'lmadi.

source: We are here to help you succeed
uz: Sizning muvaffaqiyatingiz uchun doim yordamga tayyormiz

source: Perfect for trying out BotFactory
uz: BotFactory ni sinab ko'rish uchun mukammal

source: Basic support
uz: Asosiy yordam

source: Priority support
uz: Ustuvor yordam

source: Switch to Free
uz: Bepul rejaga o'tish

source: Most Popular
uz: Eng mashhur

source: Great for small businesses
uz: Kichik bizneslar uchun ajoyib

source: Custom bot personalities
uz: Moslashtirilgan bot shaxsiyatlari

source: Switch to Basic
uz: Asosiy rejaga o'tish

source: For growing businesses and agencies
uz: O'sib borayotgan bizneslar va agentliklar uchun

source: Unlimited
uz: Cheksiz

source: Advanced analytics
uz: Ilg'or analitika

source: API access
uz: API kirish huquqi

source: Choose Premium
uz: Premium ni tanlang

source: Feature Comparison
uz: Xususiyatlarni taqqoslash

source: Feature
uz: Xususiyat

source: Basic
uz: Asosiy

source: Custom AI Personalities
uz: Moslashtirilgan AI shaxsiyatlari

source: Advanced
uz: Ilg'or

source: API Access
uz: API kirish huquqi

source: Community
uz: Hamjamiyat

source: Priority
uz: Ustuvor

source: Frequently Asked Questions
uz: Tez-tez beriladigan savollar

source: Can I upgrade or downgrade my plan anytime?
uz: Rejamni istalgan vaqtda yangilay yoki pastlashtira olamanmi?

source: Yes, you can upgrade or downgrade your subscription plan at any time. Changes take effect immediately, and billing is prorated accordingly.
uz: Ha, siz istalgan vaqtda obuna rejangizni yangilay yoki pastlashtira olasiz. O'zgarishlar darhol kuchga kiradi va to'lov shunga mos ravishda hisoblanadi.

source: What happens if I exceed my message limit?
uz: Xabar limitini oshirib yuborsam nima bo'ladi?

source: When you reach your monthly message limit, your bots will temporarily stop responding until the next billing cycle or you upgrade your plan. We'll notify you before you reach the limit.
uz: Oylik xabar limitingizga yetganingizda, botlaringiz keyingi hisob-kitob davrigacha yoki rejangizni yangilamaguningizcha vaqtincha javob berishni to'xtatadi. Limitga yetishdan oldin sizni xabardor qilamiz.

source: Is there a free trial for paid plans?
uz: Pullik rejalar uchun bepul sinov davri bormi?

source: Yes! All paid plans come with a 14-day free trial. You can cancel anytime during the trial period without being charged.
uz: Ha! Barcha pullik rejalar 14 kunlik bepul sinov davri bilan keladi. Sinov davri mobaynida istalgan vaqtda bekor qila olasiz va hech qanday to'lov olinmaydi.

source: What payment methods do you accept?
uz: Qanday to'lov usullarini qabul qilasiz?

source: We accept all major credit cards (Visa, Mastercard, American Express) and PayPal. All payments are processed securely through Stripe.
uz: Biz barcha asosiy kredit kartalarni (Visa, Mastercard, American Express) va PayPal ni qabul qilamiz. Barcha to'lovlar Stripe orqali xavfsiz tarzda qayta ishlanadi.

source: Yes, you can cancel your subscription at any time. Your bots will continue to work until the end of your current billing period, after which they'll be downgraded to the free plan limits.
uz: Ha, obunangizni istalgan vaqtda bekor qila olasiz. Botlaringiz joriy hisob-kitob davri tugaguncha ishlashda davom etadi, shundan so'ng ular bepul reja chegaralariga tushiriladi.

source: Ready to get started?
uz: Boshlashga tayyormisiz?

source: Choose a plan that fits your needs and start building powerful AI chatbots today.
uz: Ehtiyojlaringizga mos rejani tanlang va bugunoq kuchli AI chatbotlarini qurishni boshlang.

source: Compare All Features
uz: Barcha xususiyatlarni solishtiring

source: Welcome Back
uz: Xush kelibsiz

source: Sign in to your BotFactory account
uz: BotFactory hisobingizga kiring

source: Enter your username
uz: Foydalanuvchi nomingizni kiriting

source: Enter your password
uz: Parolingizni kiriting

source: Remember me
uz: Meni eslab qol

source: Sign In
uz: Kirish

source: Forgot your password?
uz: Parolingizni unutdingizmi?

source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: AI-Powered
uz: AI asosidagi

source: Telegram Ready
uz: Telegram tayyor

source: AI Chatbot Platform
uz: AI Chatbot Platformasi

source: Set up your intelligent chatbot with custom personality and purpose
uz: Moslashtirilgan shaxsiyat va maqsad bilan aqlli chatbotingizni sozlang

source: Describe what your bot does and how it helps users...
uz: Botingiz nima qilishini va foydalanuvchilarga qanday yordam berishini tasvirlab bering...

source: Optional: Describe your bot's purpose and capabilities
uz: Ixtiyoriy: Botingizning maqsadi va imkoniyatlarini tasvirlab bering

source: You are a helpful AI assistant...
uz: Siz foydali AI yordamchisisiz...

source: You are a helpful AI assistant. You provide accurate, friendly, and professional responses to user questions. Always be polite and try to be as helpful as possible.
uz: Siz foydali AI yordamchisisiz. Foydalanuvchi savollariga aniq, do'stona va professional javoblar berasiz. Har doim xushmuomala bo'ling va iloji boricha yordam berishga harakat qiling.

source: Define how your bot should behave and respond. This is like giving your bot a personality and role.
uz: Botingiz qanday harakat qilishi va javob berishi kerakligini belgilang. Bu botingizga shaxsiyat va rol berishga o'xshaydi.

source: Choose Platform
uz: Platformani tanlang

source: Available on all plans
uz: Barcha rejalarda mavjud

source: Available with your plan
uz: Sizning rejangizda mavjud

source: Requires Basic+ plan
uz: Basic+ reja talab qilinadi

source: Requires Premium plan
uz: Premium reja talab qilinadi

source: Need more platforms?
uz: Ko'proq platformalar kerakmi?

source: Upgrade your plan
uz: Rejangizni yangilang

source: Bot Personality Examples
uz: Bot shaxsiyati namunalari

source: Customer Support Bot:
uz: Mijozlarni qo'llab-quvvatlash boti:

source: You are a friendly customer support representative. Help users with their questions, provide product information, and escalate complex issues when needed.
uz: Siz do'stona mijozlarni qo'llab-quvvatlash vakiliisiz. Foydalanuvchilarga savollarida yordam bering, mahsulot ma'lumotlarini taqdim eting va kerak bo'lganda murakkab masalalarni yuqori darajaga yo'naltiring.

source: Educational Tutor:
uz: Ta'lim o'qituvchisi:

source: You are an encouraging tutor. Explain concepts clearly, ask questions to check understanding, and provide examples to help students learn.
uz: Siz rag'batlantiruvchi o'qituvchisiz. Tushunchalarni aniq tushuntiring, tushunishni tekshirish uchun savollar bering va o'quvchilarga o'rganishda yordam berish uchun misollar keltiring.

source: Cancel
uz: Bekor qilish

source: Create Bot
uz: Bot yaratish

source: Next Steps After Creation
uz: Yaratishdan keyingi qadamlar

source: Connect Platform
uz: Platformani ulash

source: Link your bot to chosen platform (Telegram, Instagram, WhatsApp)
uz: Botingizni tanlangan platformaga ulang (Telegram, Instagram, WhatsApp)

source: Add documents and information for your bot
uz: Botingiz uchun hujjatlar va ma'lumotlar qo'shing

source: Test your bot responses before going live
uz: Jonli efirga chiqishdan oldin bot javoblarini sinang

source: Make your bot available to users
uz: Botingizni foydalanuvchilar uchun mavjud qiling

source: Last activity:
uz: Oxirgi faollik:

source: No description
uz: Tavsif yo'q

source: Train %(bot_name)s with your content and documents
uz: %(bot_name)s ni kontentingiz va hujjatlaringiz bilan o'rgating

source: Add Entry
uz: Yozuv qo'shish

source: Has Image
uz: Rasm bor

source: Added
uz: Qo'shilgan

source: View Full Content
uz: To'liq kontentni ko'rish

source: Edit
uz: Tahrirlash

source: Are you sure you want to delete this entry?
uz: Ushbu yozuvni o'chirishni xohlaysizmi?

source: Close
uz: Yopish

source: Edit Knowledge Entry
uz: Bilimlar yozuvini tahrirlash

source: Title
uz: Sarlavha

source: Content
uz: Kontent

source: No Knowledge Base Entries
uz: Bilimlar bazasi yozuvlari yo'q

source: Add documents, FAQs, and information to help your bot provide better answers.
uz: Botingiz yaxshiroq javoblar berishi uchun hujjatlar, FAQ va ma'lumotlar qo'shing.

source: Add Your First Entry
uz: Birinchi yozuvingizni qo'shing

source: Knowledge Base Stats
uz: Bilimlar bazasi statistikasi

source: Total Entries
uz: Jami yozuvlar

source: Uploaded Files
uz: Yuklangan fayllar

source: Knowledge Base Tips
uz: Bilimlar bazasi maslahatlari

source: FAQs Work Best:
uz: FAQ eng yaxshi ishlaydi:

source: Add frequently asked questions and their answers for immediate bot responses.
uz: Tez-tez beriladigan savol va javoblarni qo'shing - bot darhol javob beradi.

source: Clear Titles:
uz: Aniq sarlavhalar:

source: Use descriptive titles that match what users might ask about.
uz: Foydalanuvchilar so'rashi mumkin bo'lgan narsaga mos keladigan tavsiflovchi sarlavhalardan foydalaning.

source: Context Matters:
uz: Kontekst muhim:

source: Include background information to help the AI understand your content better.
uz: AI kontentingizni yaxshiroq tushunishi uchun fon ma'lumotlarini kiriting.

source: Keep Updated:
uz: Yangilab turing:

source: Regularly update your knowledge base with new information.
uz: Bilimlar bazangizni yangi ma'lumotlar bilan muntazam yangilab turing.

source: Add Text Entry
uz: Matn yozuvini qo'shish

source: Upload File
uz: Fayl yuklash

source: Back to Bot
uz: Botga qaytish

source: Add Knowledge Base Entry
uz: Bilimlar bazasi yozuvini qo'shish

source: Enter a descriptive title...
uz: Tavsiflovchi sarlavha kiriting...

source: This helps organize your knowledge and makes it easier to find.
uz: Bu bilimlaringizni tartibga solishga va topishni osonlashtirishga yordam beradi.

source: Enter the content that your bot should know about...
uz: Botingiz bilishi kerak bo'lgan kontentni kiriting...

source: Include as much detail as possible for better AI responses.
uz: Yaxshiroq AI javoblari uchun iloji boricha ko'proq tafsilot kiriting.

source: Product Image (optional)
uz: Mahsulot rasmi (ixtiyoriy)

source: Image URL
uz: Rasm URL manzili

source: Enter the direct URL to your product image. Bot will send this image when relevant.
uz: Mahsulot rasimingizning to'g'ridan-to'g'ri URL manzilini kiriting. Bot tegishli bo'lganda ushbu rasmni yuboradi.

source: Image Caption
uz: Rasm izoji

source: Product name or short description
uz: Mahsulot nomi yoki qisqa tavsif

source: Brief description that will be sent with the image.
uz: Rasm bilan birga yuboriladigan qisqa tavsif.

source: Bots
uz: Botlar

source: 100 messages/month
uz: 100 xabar/oyiga

source: Telegram integration
uz: Telegram integratsiyasi

source: Get Started
uz: Boshlash

source: 5 AI chatbots
uz: 5 AI chatbot

source: 1,000 messages/month
uz: 1,000 xabar/oyiga

source: Advanced knowledge base
uz: Rivojlangan bilimlar bazasi

source: Start Free Trial
uz: Bepul sinovni boshlash

source: 25 AI chatbots
uz: 25 AI chatbot

source: 10,000 messages/month
uz: 10,000 xabar/oyiga

source: Unlimited knowledge base
uz: Cheksiz bilimlar bazasi

source: Analytics & API access
uz: Analitika va API kirish

source: Ready to Create Your AI Chatbot?
uz: AI Chatbotingizni yaratishga tayyormisiz?

source: Join thousands of businesses using BotFactory to provide better customer support and engagement through AI-powered chatbots.
uz: BotFactory dan foydalanib, AI asosidagi chatbotlar orqali yaxshiroq mijozlarga xizmat ko'rsatish va muloqot qilish uchun minglab bizneslar bilan qo'shiling.

source: Start Building for Free
uz: Bepul yaratishni boshlang

source: No credit card required • 14-day free trial on paid plans
uz: Kredit karta talab qilinmaydi • Pullik rejalarda 14 kunlik bepul sinov
